Repository: el-cms/Acl
Catalog: Locale/fra/LC_MESSAGES/acl.po
Languages: fr

source: The role model name is unknown. The ACL plugin bootstrap.php file has to be loaded in order to work. (see the README file)
fr: Le nom du modèle servant de rôle est inconnu. Le fichier bootstrap.php du plugin ACL doit être chargé pour que le plugin fonctionne. (voir fichier README)

source: The actions in the ACO table have been deleted
fr: Les actions dans la table ACO ont été effacées

source: The actions in the ACO table could not be deleted
fr: Les actions dans la table ACO n'ont pas pu être effacées

source: Clear actions ACOs
fr: Destruction des ACOs

source: Build actions ACOs
fr: Compléter les ACOs

source: Prune actions ACOs
fr: Nettoyer les ACOs

source: Synchronize actions ACOs
fr: Synchroniser les ACOs

source: The user role has been updated
fr: Le rôle de l'utilisateur a été modifié

source: The user role could not be updated
fr: Le rôle de l'utilisateur n'a pas pu être mis à jour

source: The user '%s' does not exist in the ARO table
fr: L'utilisateur '%s' n'existe pas dans la table des AROs

source: The permissions have been cleared
fr: Les permissions ont été effacées

source: The permissions could not be cleared
fr: Les permissions ont été effacées

source: The specific permissions have been cleared
fr: Les permissions spécifiques de l'utilisateur ont été effacées

source: The specific permissions could not be cleared
fr: Les permissions spécifiques de l'utilisateur n'ont pas pu être effacées

source: The role '%s' does not exist in the ARO table
fr: Le rôle '%s' n'existe pas dans la table des AROs

source: the %s directory is not writable
fr: le dossier %s est interdit en écriture

source: Aco node '%s' created
fr: Le noeud ACO '%s' a été créé

source: Aco node '%s' has been deleted
fr: Le noeud ACO '%s' a été effacé

source: Aco node '%s' could not be deleted
fr: Le noeud ACO '%s' n'a pas pu être effacé

source: An error occured while saving the specific permission
fr: Une erreur est survenue en sauvant la permission spécifique

source: An error occured while deleting the specific permission
fr: Une erreur est survenue en effaçant la permission spécifique

source: The specific permission id could not be retrieved
fr: La permission spécifique n'a pas été trouvée

source: The child ACO id could not be retrieved
fr: L'élément ACO enfant n'a pas été trouvé

source: Invalid ARO
fr: ARO invalide

source: The following actions ACOs have been created
fr: Les ACOs pour les actions suivantes ont été créés

source: There was no new actions ACOs to create
fr: Aucune nouvelle action à créer comme ACO n'a été trouvée

source: This page allows you to build missing actions ACOs if any.
fr: Cette page permet de compléter la table des ACOs en ajoutant les éventuelles actions non-répertoriées.

source: Missing ACOs
fr: ACOs manquants

source: Clicking the link will not destroy existing actions ACOs.
fr: Cliquer sur le lien ne détruira pas les actions déjà répertoriées.

source: Build
fr: Compléter

source: There is no ACO node to create
fr: Il n'y a aucun noeud ACO à créer

source: This page allows you to clear all actions ACOs.
fr: Cette page permet d'effacer les actions répertoriées comme ACOs.

source: Clicking the link will destroy all existing actions ACOs and associated permissions.
fr: Cliquer sur le lien détruira toutes les actions répertoriées comme ACOs et leurs premissions associées.

source: Clear ACOs
fr: Détruire les ACOs existants

source: Are you sure you want to destroy all existing ACOs ?
fr: Êtes-vous sûr de vouloir détruire les ACOs existants ?

source: There is no ACO node to delete
fr: Il n'y a aucun noeud ACO à effacer

source: Some controllers have been modified, resulting in actions that are not referenced as ACO in the database or ACO records that are obsolete
fr: Certains contrôleurs ont été modifiés. En conséquence certaines actions ne sont pas référencées dans la table des ACO ou au contraire ne devraient plus l'être

source: Obsolete ACOs
fr: ACOs obsolètes

source: You can update the ACOs by clicking on the following link
fr: Vous pouvez mettre à jour les ACOs en cliquant sur le lien suivant

source: Synchronize ACOs
fr: Synchroniser les ACOs

source: Please be aware that this message will appear only once. But you can always rebuild the ACOs by going to the ACO tab.
fr: Veuillez noter que ce message n'apparaîtra qu'une seule fois. Vous pouvez cependant compléter les ACOs à tout moment en vous rendant sur l'onglet des <em>Actions</em>.

source: The following actions ACOs have been pruned
fr: Les noeuds ACOs pour les actions suivantes ont été effacés

source: There was no actions ACOs to prune
fr: Aucun noeud ACO à effacer n'a été trouvé

source: This page allows you to prune obsolete ACOs.
fr: Cette page permet d'effacer les noeuds ACOs obsolètes.

source: Obsolete ACO nodes
fr: Noeuds ACO obsolètes

source: Clicking the link will not change or remove permissions for actions ACOs that are not obsolete.
fr: Cliquer sur le lien ne modifiera pas les permissions existantes pour les actions qui ne sont pas obsolètes.

source: Prune
fr: Nettoyer

source: New ACOs
fr: Nouveaux ACOs

source: There was no action ACO to delete
fr: Aucun noeud ACO à effacer n'a été trouvé

source: This page allows you to synchronize the existing controllers and actions with the ACO datatable.
fr: Cette page permet de synchroniser les contrôleurs et les actions existantes avec la table des ACOs.

source: Clicking the link will not change or remove permissions for existing actions ACOs.
fr: Cliquer sur le lien ne modifiera pas les permissions existantes pour les actions déjà répertoriées.

source: Synchronize
fr: Synchroniser

source: The ACO datatable is already synchronized
fr: La table ACO est déjà synchronisée

source: Clear permissions table
fr: Vider la table des permissions

source: Are you sure you want to delete all roles and users permissions ?
fr: Êtes-vous sûr de vouloir détruire l'ensembe des permissions des rôles et des utilisateurs ?

source: Mass permissions
fr: Permissions en masse

source: Be careful, mass permissions will overwrite custom ones.
fr: Attention, le changement en masse va supprimer toutes les configurations particulières.

source: grant access to <em>all actions</em>
fr: donner accès à <em>toutes les actions</em>

source: deny access to <em>all actions</em>
fr: bloquer l'accès à <em>toutes les actions</em>

source: Are you sure you want to grant access to all actions of each controller to the role '%s' ?
fr: Êtes-vous sûr de vouloir donner accès à toutes les actions de tous les contrôleurs au rôle '%s' ?

source: Are you sure you want to deny access to all actions of each controller to the role '%s' ?
fr: Êtes-vous sûr de vouloir bloquer l'accès à toutes les actions de tous les contrôleurs au rôle '%s' ?

source: Specific permissions
fr: Permissions spécifiques

source: Legend:
fr: Légende :

source: Permission granted
fr: Permission autorisée

source: Permission denied
fr: Permissions refusée

source: Loading...
fr: Chargement...

source: The ACO node is probably missing. Please try to rebuild the ACOs first.
fr: Le noeud ACO semble manquer. Veuillez essayer de reconstruire la table ACO.

source: User
fr: Utilisateur

source: Role
fr: Rôle

source: Update the user role
fr: Modifier le rôle de l'utilisateur

source: This user has specific permissions.
fr: Cet utilisateur a des permissions spécifiques.

source: Reset to role permissions
fr: Appliquer les permissions de rôle

source: Are you sure you want to clear the permissions specific to this user ?
fr: Êtes-vous sûr de vouloir détruire les permissions spécifiques de cet utilisateur ?

source: authorization
fr: autorisation

source: There is no missing ARO.
fr: Il n'y a aucun ARO manquant.

source: Roles without corresponding Aro
fr: Rôles sans ARO correspondant

source: Users without corresponding Aro
fr: Utilisateurs sans ARO correspondant

source: The <em>%s</em> model is not configured to act as an <em>ACL requester</em>
fr: Le modèle <em>%s</em> n'est pas configuré comme un <em>ACL requester</em>

source: In a classical ACL configuration, the models that represent the users and the roles must act as <em>ACL requesters</em> (see %s).
fr: Dans une configuration ACL classique, les modèles représentant les utilisateurs et les rôles doivent agir comme des <em>ACL requesters</em> (voir %s).

source: Acts As a Requester
fr: Agir comme un Requêteur

source: If you wish, you can disable this alert by setting the ACL plugin parameter 'acl.check_act_as_requester' to <em>false</em>.
fr: Si vous le souhaitez, vous pouvez désactiver cette alerte en mettant le paramètre du plugin 'acl.check_act_as_requester' à <em>false</em>.

source: This page allows to manage users specific rights
fr: Cette page permet de gérer les droits particuliers de chaque utilisateur

source: User name
fr: Nom d'utilisateur

source: filter
fr: filtrer

source: user
fr: utilisateur

source: Manage user specific rights
fr: Gérer les droits particuliers de l'utilisateur

source: Authorization
fr: Autorisation

source: authorized
fr: autorisé

source: blocked
fr: bloqué

source: Filter
fr: Filtrer

source: Some users AROS are missing. Click on a role to assign one to a user.
fr: Certains utilisateurs n'ont pas de ARO associé. Vous pouvez les créer en cliquant sur un rôle.

source: name
fr: nom

source: The role node does not exist in the ARO table
fr: Le rôle n'existe pas dans la table ARO

source: Denied
fr: Refusé

source: Granted
fr: Autorisé

source: The user node does not exist in the ARO table
fr: L'utilisateur n'existe pas dans la table ARO

source: The ARO or the ACO node is probably missing. Please try to rebuild the ACOs first.
fr: Un noeud ARO ou ACO semble manquer. Veuillez essayer de reconstruire la table ACO.

source: are you sure ?
fr: êtes-vous sûr ?

source: Build missing AROs
fr: Compléter les AROs

source: Users roles
fr: Rôles des utilisateurs

source: Roles permissions
fr: Permissions des rôles

source: Users permissions
fr: Permissions des utilisateurs

source: Go to homepage
fr: Revenir à l'accueil

source: Sync actions ACOs
fr: Synchroniser les ACOs

source: Sync missing AROs
fr: Compléter les AROs

source: Help
fr: Aide
